example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-18 Sat 05:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>example code of jojo</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="http://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
長悲嘆而掩面兮 憐其獨於夢睹
</div>
<div id="content">
<h1 class="title">example code of jojo</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1fe4ac">define function</a></li>
<li><a href="#org3f0be98">loop by explicit tail-call</a></li>
<li><a href="#org6ee26f2">branching by if</a></li>
<li><a href="#orga8d6c94">receive function</a></li>
<li><a href="#org748d709">string</a></li>
<li><a href="#orgebadea7">file</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge1fe4ac" class="outline-2">
<h2 id="orge1fe4ac">define function</h2>
<div class="outline-text-2" id="text-orge1fe4ac">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">~</span> square <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> int int <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> int<span style="color: #696969;">)</span>
   dup mul end<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">!</span> <span style="color: #696969;">(</span># 11<span style="color: #696969;">)</span> square .<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f0be98" class="outline-2">
<h2 id="org3f0be98">loop by explicit tail-call</h2>
<div class="outline-text-2" id="text-org3f0be98">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">~</span> apply-key <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> jo <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> *<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup jo-used? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> apply end<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> true <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       <span style="color: #696969;">(</span>string <span style="color: #696969;">(</span>undefined keyword : <span style="color: #696969;">))</span> print-string
       jo-&gt;string print-string end<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">~</span> stack-repl <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> *<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> read-jo round-bar eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> read-jo apply-key print-stack<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span>tail-call stack-repl<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">!</span> stack-repl<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ee26f2" class="outline-2">
<h2 id="org6ee26f2">branching by if</h2>
<div class="outline-text-2" id="text-org6ee26f2">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">!</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> true <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> true . end<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> false <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> false . end<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga8d6c94" class="outline-2">
<h2 id="orga8d6c94">receive function</h2>
<div class="outline-text-2" id="text-orga8d6c94">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">~</span> factorial <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> int <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> int<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup <span style="color: #696969;">(</span># 1<span style="color: #696969;">)</span> lteq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #696969;">(</span># 1<span style="color: #696969;">)</span> end<span style="color: #696969;">)</span>
   dup <span style="color: #696969;">(</span># 1<span style="color: #696969;">)</span> sub factorial mul end<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">!</span> <span style="color: #696969;">(</span># 0<span style="color: #696969;">)</span> factorial .
   <span style="color: #696969;">(</span># 1<span style="color: #696969;">)</span> factorial .
   <span style="color: #696969;">(</span># 2<span style="color: #696969;">)</span> factorial .
   <span style="color: #696969;">(</span># 3<span style="color: #696969;">)</span> factorial .
   <span style="color: #696969;">(</span># 4<span style="color: #696969;">)</span> factorial .<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org748d709" class="outline-2">
<h2 id="org748d709">string</h2>
<div class="outline-text-2" id="text-org748d709">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">!</span> <span style="color: #696969;">(</span>string <span style="color: #696969;">(</span>test1<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>test2<span style="color: #696969;">))</span> print-string print-string<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebadea7" class="outline-2">
<h2 id="orgebadea7">file</h2>
<div class="outline-text-2" id="text-orgebadea7">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">!</span> <span style="color: #696969;">(</span>string <span style="color: #696969;">(</span>README<span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span># 1024<span style="color: #696969;">)</span> allocate tuck
   <span style="color: #696969;">(</span># 1024<span style="color: #696969;">)</span> read-file .
   print-string<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
涕执我乎垂丧兮 懼余生之茫苦
</div>
</body>
</html>
